#include <iostream>
#include <iomanip> // нужно для setw() 
#include <cmath>

using namespace std;

int main() 
{
    double a;
    double b;
    int n;

    cout << "Введите a: ";
    cin >> a;
    cout << "Введите b: ";
    cin >> b;
    cout << "Введите n: ";
    cin >> n;

    double h = (b - a) / n;

    if( a >= b )
    {
        cout << "\n Введены некорректные данные. a должна быть меньше b";
        return 0;
    }

    if (n <= 0)
    {
        cout << "\n Введены некорректные данные. n должна быть больше нуля";
        return 0;
    }

    cout << "\nШаг h = " << h << "\n";

    //верхняя рамка
    cout << "---------------------------------------------------------\n";
    cout << "|    i   |      x_i    |     F(x_i)      |     G(x_i)   |\n";
    cout << "---------------------------------------------------------\n";

    //строки таблицы в цикле
    for (int i = 0; i <= n; i++) 
    {
        double x = a + i * h;
        double F = sin(x) * cos(x);
        double G = (x - 1) * (x - 1) * (x - 1);

        // setw(N) задает точную ширину поля для следующего выводимого значения
        cout << "| " << setw(5)  << i << " "
             << "| " << setw(13) << x << " "
             << "| " << setw(13) << F << " "
             << "| " << setw(13) << G << " |\n";
    }

    //нижняя рамка
    cout << "---------------------------------------------------------\n";

    return 0;
}